[{
    "name": "Nom du projet",
    "tags": ["ld", "gd"],
    "img": "assets/img/robin.png",
    "description": "Living Rock est un jeu que j'ai réalisé avec une équipe de 7 personnes en tant que Level Designer/Game Designer lors de l'UniJam 2022 en un weekend. Le thème de l'Unijam était \"La distance rend toute chose infiniment plus précieuse\". L'idée de base était de réaliser un jeu de combat qui utilise la distance avec un élément pour certaines mécaniques. Mais ayant peur que ça soit une charge de travail trop importante nous nous sommes dirigés vers un jeu à énigme. Nous incarnons donc un personnage qui se voit lié à un cristal, s'il s'éloigne de trop il meurt, il va donc devoir le prendre avec lui à tout moment. Il va pouvoir utiliser le cristal pour résoudre des énigmes. Nous avons donc commencé à travailler sur le Game Concept afin de trouver les mécaniques les plus interessantes à réaliser dans le jeu. Nous avons travaillé à deux sur cette partie-là, j'avais un rôle de support puisque ma fonction principale était le Level Design. Une fois les mécaniques et le game concept terminés le Game Designer de l'équipe a commencé à faire le Game Document allant plus précisément dans les détails et moi j'ai commencé à faire le Level Design. Le Level Design a été un vrai défi pour moi puisque je n'avais jamais fait de niveau à énigmes et cela a été une vraie gymnastique d'esprit de faire des niveaux cohérents, montant en difficulté sans que ça soit trop complexe. J'ai cherché à utiliser les mécaniques en lien avec le cristal au maximum afin de rendre ça le plus intéressant possible. On avait également pensé à des mécaniques jouant avec la visibilité ou encore un niveau consacré uniquement à une mécanique de téléportation influençant le cristal mais nous n'avons pas eu le temps d'intégrer ces niveaux. Cette Game Ham fut très intéressante car c'était la première fois que j'en faisais une en équipe et j'ai beaucoup appris en ce qui concerne le travail d'équipe mais également en Level Design.",
    "images": [{ "url": "assets/img/robin.png", "legende": "Petite légende" }],
    "buttons": [{
        "name": "Voir le projet",
        "icon": "launch",
        "link": "https://davall.fr"
    }]
}, {
    "name": "Site web",
    "tags": ["web"],
    "img": "assets/img/robin.png",
    "description": "Lorem Ipsalum lol",
    "images": [{ "url": "assets/img/cv.png", "legende": "Petite légende" }, { "url": "assets/img/robin.png", "legende": "Petite légende" }],
    "buttons": [{
        "name": "Voir le projet",
        "icon": "launch",
        "link": "https://davall.fr"
    },{
        "name": "Vidéo",
        "link": "https://davall.fr"
    }]
}]