[
    {
        "name": "QBT",
        "date": "Septembre 2024 à Février 2025",
        "tags": [
            "ld",
            "ta",
            "dev"
        ],
        "img": "assets/img/qbt-mainlogo.png",
        "description": "QBT est un jeu à la première personne dans lequel on incarne un sujet dans un laboratoire en bichromie qui est capable de changer sa gravité. \nJe suis Level Designer, Technical Artist et Lead Développeur sur le projet. Le jeu est en cours de production, vous pouvez suivre les dev log sur le itch.io si cela vous intéresse.",
        "images": [
            {
                "url": "assets/img/qbt-screen1.png",
                "legende": "Direction artistique de l'intérieur du laboratoire"
            },            
            {
                "url": "assets/img/qbt-screen2.png",
                "legende": "Direction artistique de l'intérieur du laboratoire"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://robin-lefebvre.itch.io/qbt"
            }
        ],
        "keep": true,
        "main": true
    },
    {
        "name": "Tekuteku : Fishing Adventure",
        "date": "Avril 2024 à Août 2024",
        "tags": [
            "ld",
            "ta"
        ],
        "img": "assets/img/TekutekuMain4.png",
        "description": "Tekuteku : Fishing Adventure est un jeu d'aventure et de pêche se déroulant sur le dos d’une baleine volante dans lequel on incarne un pêcheur de l'espèce des Tekuteku.Sur ce projet,j'ai travaillé en tant que Level Designer et Technical Artist dans le cadre de la première année de mon master.\n J’ai fait la conception du niveau. un assez grand niveau mettant en avant les différents oiseaux du jeu. Le jeu s'axe autour de plusieurs oiseaux contrôlable par le joueur à l'aide d'un autel sur lequel on pose des poissons. J'ai également intégrés avec Unity ce qui m’a appris à utiliser les différents outils que Unity mettait à disposition ainsi que de choisir la meilleure solution pour notre jeu. \n\n Pitch : \"Incarnez un pêcheur capable de prendre le contrôle d’un oiseau et parcourez le monde tout en résolvant des énigmes pour atteindre votre objectif. Partez à la recherche de l’élu qui ne donne plus de nouvelles depuis plusieurs mois.",
       

        "images": [
            {
                "url": "assets/img/TekutekuMain1.png",
                "legende": "Screenshot du jeu"
            },
            {
                "url": "assets/img/Tekuteku1.png",
                "legende": "Screenshot du jeu"
            },
            {
                "url": "assets/img/Tekuteku2.png",
                "legende": "Screenshot du jeu"
            },
            {
                "url": "assets/img/Tekuteku4.png",
                "legende": "Screenshot du jeu"
            },
            {
                "url": "assets/img/Tekuteku8.png",
                "legende": "Screenshot du jeu"
            },
            {
                "url": "assets/img/Tekuteku9.png",
                "legende": "Screenshot du jeu"
            },
            {
                "url": "assets/img/Tekuteku11.png",
                "legende": "Screenshot du jeu"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://xc3l.itch.io/tekuteku-fishing-adventure"
            }
        ],
        "keep": true,
        "main": true
    },
    {
        "name": "Anthares",
        "date": "Septembre 2023 à Février 2024",
        "tags": [
            "gd",
            "ld",
            "qa"
        ],
        "img": "assets/img/anthares-mainlogo.png",
        "description": "Anthares est un jeu sur lequel j'ai travaillé en tant que Game Designer, Level Designer et QA Tester dans le cadre de la première année de mon master. J’ai pu réaliser le Game Design Document ainsi que les différents Documents de Spécification ainsi que Level Design du jeu. J’ai également équilibré les différentes attaques, les déplacements et les pièges. En tant que QA Tester, j’ai réalisé des procédures de test à suivre à chaque build, de nombreux tickets ainsi que la mise en place du Jira sur lequel on les a répertorié. \n\n Pitch : \"Dans un univers futuriste où chacun utilise la cyber-technologie, participez au grand tournoi Anthares organisé par The Talos Conglomerate. Affrontez vous en local avec des personnages aux compétences uniques et battez votre adversaire lors d’un 1 contre 1 dynamique et fluide dans une arène remplie de pièges et devenez une légende du show-bizness !\" \n\n Lors de la réalisation de ce projet nous avions plusieurs objectifs en tête: \n- Tout d'abord que le jeu soit hype, pour se faire nous avons intégré un système obligeant les joueurs à tuer avec une attaque moyenne ou lourde ce qui l'oblige à prendre des risques. \n - Ensuite, d'avoir une mécanique particulière et plus ou moins différente des autres jeux de combats, ce qui représenterait notre Key Selling Point. Nous avons décidé de choisir les pièges permettant de mettre un accent fort sur la carte qui représente aussi un danger pour le joueur. \n - Pour finir, nous voulions avoir un jeu avec une ambiance forte du show-business futuriste pour rendre notre jeu plus marquant par son univers.",
        "images": [
            {
                "url": "assets/img/anthares-mainlogo.png",
                "legende": "Banière du jeu sur Itch.io"
            },
            {
                "url": "assets/img/anthares-screen1.png",
                "legende": "Menu principal du jeu"
            },
            {
                "url": "assets/img/anthares-screen2.png",
                "legende": "Screen In-game"
            },
            {
                "url": "assets/img/anthares-screen3.png",
                "legende": "Screen In-game"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://robin-lefebvre.itch.io/anthares"
            }, 
            {
                "name": "Voir le Game Design Document",
                "icon": "launch",
                "link": "data/GDD-Anthares.pdf"
            }
        ],
        "keep": true,
        "main": true
    },
    {
        "name": "Pafia Masta",
        "date": "Janvier 2024 à Mars 2024",
        "tags": [
            "dev",
            "gd"
        ],
        "img": "assets/img/pafiamasta-mainlogo.png",
        "description": "Pafia Masta est un jeu sur lequel j'ai travaillé en tant que Développeur et Game Designer dans le cadre de la première année de mon master. \n Pitch : \"Un crime affreux a eu lieu dans le Pasta Village, quelqu’un a empoisonné la Carbonara Piscine avec de la crème fraîche 🤮 ! En tant que Gnocchi Détective la plus reconnue, interrogez les habitants, rendez leur un service, découvrez leurs routines, et trouvez le coupable !\" \n\n Pafia Masta est un jeu narratif et une murder party dans laquelle le joueur va devoir participer à plusieurs mini-jeux, résoudre des énigmes et parler avec les habitants pour savoir qui est la personne qui à empoisonné la Carbonara Piscine. ",
        "images": [
            {
                "url": "assets/img/pafiamasta-mainlogo.png",
                "legende": "Banière du jeu sur Itch.io"
            },
            {
                "url": "assets/img/pafiamasta-screen1.png",
                "legende": "Menu principal du jeu"
            },
            {
                "url": "assets/img/pafiamasta-screen2.png",
                "legende": "Screen In-game"
            },
            {
                "url": "assets/img/pafiamasta-screen3.png",
                "legende": "Screen In-game"
            },
            {
                "url": "assets/img/pafiamasta-screen4.png",
                "legende": "Screen In-game"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://xc3l.itch.io/pafia-masta"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Game Design Document pour Don't Be Fired !!",
        "date": "Avril 2023",
        "tags": [
            "gd"
        ],
        "img": "assets/img/logo-gdd-firedsimu.png",
        "description": "Ce travail est un Game Design Document de Don't Be Fired !! que j'ai réalisé basé sur le Game Concept du jeu",
        "images": [
            {
                "url": "assets/img/logo-gdd-firedsimu.png",
                "legende": "GDD"
            }
        ],
        "buttons": [
            {
                "name": "Voir le document",
                "icon": "launch",
                "link": "data/Game-Design-Document_Dont-Be-Fired_Robin-LEFEBVRE.pdf"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Booom!",
        "date": "Janvier 2023 à Mars 2023",
        "tags": [
            "dev",
            "gd"
        ],
        "img": "assets/img/Booom-logo.png",
        "description": "Booom! est un jeu que j'ai réalisé en équipe pour le projet de fin d'études de notre licence professionnelle métier du jeu vidéo parcours Game design et Level design. Nous étions une équipe de 5 et j'étais développeur et Game designer. \r\n\r\n  Le pitch :\"La vie sur Terre se déroule paisiblement ne se doutant pas qu'un astéroïde fonce tout droit sur elle ! Vous incarnez cet astéroïde faisant sa course vers la Terre tout en accumulant des débris pour gagner en masse et en vitesse afin de faire un maximum de dégâts à la planète !\" \r\n\r\n Nous avons pensé ce jeu comme étant \"juicy\", fun et simple à jouer avec une forte inspiration des jeux flashs et des références d'autres univers avec des débris spéciaux. \r\n Nous avons eu 8 semaines de la conception à la réalisation. Ce fut une expérience très intéressante qui m'a permis de m'améliorer en Game Design et en développement Unity. C'est également une expérience qui m'a permis de voir l'importance de la communication et de l'organisation dans un groupe afin de mener le projet à bien.",
        "images": [
            {
                "url": "assets/img/Booom-logo.png",
                "legende": "Le logo du jeu."
            },
            {
                "url": "assets/img/Booom-menu.png",
                "legende": "Les menus du jeu."
            },
            {
                "url": "assets/img/Booom-ingame.png",
                "legende": "Capture d'écran in-game."
            },
            {
                "url": "assets/img/Booom-highscore.png",
                "legende": "Le highscore en fin de partie."
            },
            {
                "url": "assets/img/Booom-codex.png",
                "legende": "Le codex des débris spéciaux."
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://purpleluma.itch.io/booom"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Game Concept pour un Animal Crossing RPG",
        "date": "Février 2023",
        "tags": [
            "gd"
        ],
        "img": "assets/img/ACNH-RPG.png",
        "description": "Ce travail est un Game Concept que nous avons produit en groupe de 3 dans le cadre d'une évaluation qui nous demandait de faire un game concept pour Animal Crossing New Horizon en version RPG.",
        "images": [
            {
                "url": "assets/img/ACNH-RPG.png",
                "legende": "Première page de document"
            }
        ],
        "buttons": [
            {
                "name": "Voir le document",
                "icon": "launch",
                "link": "data/Animal-Crossing_Game-Concept.pdf"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Document de spécification d'une mécanique de craft de Cube World",
        "date": "Février 2023",
        "tags": [
            "gd"
        ],
        "img": "assets/img/Doc-spe-craft.png",
        "description": "Ce travail est un Document de Spécification que j'ai produit dans le cadre d'une évaluation qui nous demandait de faire un document de spécification sur une mécanique de craft, j'ai pris la mécanique de craft de Cube World.",
        "images": [
            {
                "url": "assets/img/Doc-spe-craft.png",
                "legende": "Première page de document"
            }
        ],
        "buttons": [
            {
                "name": "Voir le document",
                "icon": "launch",
                "link": "data/Doc-spe_craft-Cube-World-Alpha.pdf"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Cours-Je ?",
        "date": "Février 2023",
        "tags": [
            "dev",
            "gd"
        ],
        "img": "assets/img/cours-je-1.png",
        "description": "Cours-je? est un jeu que j'ai réalisé 2 semaines après la Global Game Jam 2023 avec une équipe de 4 personnes. J'avais pour rôle développeur. Le thème de cette Game Jam était \"Root\". Nous sommes donc partis sur les plantes et le reggae roots. \r\n\r\n Le pitch : \"Vous incarnez un hippie qui doit collecter des courges et de drôles d'herbes depuis son terrain à pousse super rapide afin d'éviter la pauvreté.\".\r\n\r\nCe fut une expérience très intéressante et enrichissante en tant que développeur et Game designer. Étant la personne qui développait le jeu, j'étais en contact en permanence avec les autres membres de l'équipe pour faire un jeu le plus proche possible de ce qu'on avait imaginé. De plus, j'ai beaucoup appris sur la communication entre Game Designer et développeur, car je me suis assez vite rendu compte des problèmes que pouvait rencontrer un développeur lorsque, par exemple, le document de spécification n'était pas assez détaillé. J'ai donc pu en tirer des leçons sur la manière dont je dois rédiger ce genre de document.",
        "images": [
            {
                "url": "assets/img/cours-je-1.png",
                "legende": "Le logo du jeu sur Itch.io"
            },
            {
                "url": "assets/img/cours-je-2.png",
                "legende": "Les menus du jeu."
            },
            {
                "url": "assets/img/cours-je-3.png",
                "legende": "Le début du jeu."
            },
            {
                "url": "assets/img/cours-je-4.png",
                "legende": "Une partie en cours"
            },
            {
                "url": "assets/img/cours-je-5.png",
                "legende": "Une fin de partie"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://alans-tagioo.itch.io/cours-je"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Niveau réalisé sur Unreal Engine",
        "date": "Janvier 2023",
        "tags": [
            "ld"
        ],
        "img": "assets/img/Niveau_froide_vengeance.png",
        "description": "J'ai réalisé un niveau dans le cadre d'un Workshop de Level Design sur Unreal Engin organisé dans ma licence pro métier du jeu vidéo afin d'apprendre Unreal Engine tout en mettant en pratique nos connaissances en Level Design. L'objectif était de réaliser un niveau d'A à Z sur Unreal Engine. Il fallait intégrer une phase de combat et une phase d'infiltration. J'ai donc tout d'abord cherché un thème, je suis partie sur le médiéval avec une protagoniste voleuse utilisant une arbalète pour se défendre.\n\n Je suis ensuite partie sur un contexte permettant de développer le pourquoi du comment le personnage qu'on incarne est ici : \n\n\"Voleur de profession, notre personnage vit de prime grâce au vol commandité par des riches, des pauvres mais aussi des groupes de parias, de roublards ou encore de bandits. Elle est dans les petits papiers de tout le monde et elle en a payé le prix fort. En effet, lors d’une affaire de vol qui a mal tourné, elle s’est fait repérer par un groupe de bandits qu’elle était en train de voler. Ce n’est pas resté sans conséquence, le connaissant un peu trop bien, ils ont décidé de se venger en tuant son petit frère.\"\n\nCe qui m'a permie de tirer un titre pour mon niveau : \"Vengeance Froide\" et c'est la ligne directrice que j'ai suivie dans ce niveau. ",
        "images": [
            {
                "url": "assets/img/Niveau_froide_vengeance.png",
                "legende": "Le plan du niveau au complet"
            },
            {
                "url": "assets/img/bubblediagram_vengeancefroide.png",
                "legende": "Bubble diagram"
            },
            {
                "url": "assets/img/VengeanceFroide_1.png",
                "legende": "Screen du niveau en plein jeu"
            },
            {
                "url": "assets/img/VengeanceFroide_2.png",
                "legende": "Screen du niveau en plein jeu"
            },
            {
                "url": "assets/img/VengeanceFroide_3.png",
                "legende": "Screen du niveau en plein jeu"
            }
        ],
        "buttons": [
            {
                "name": "Voir une vidéo du niveau",
                "icon": "launch",
                "link": "https://www.youtube.com/watch?v=9jDryQXAI-I"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Niveau de Left4Dead 2",
        "date": "Décembre 2022",
        "tags": [
            "ld"
        ],
        "img": "assets/img/left4dead-plan-partie2-Robin_Lefebvre.png",
        "description": "Ce travail est un plan de level design pour le jeu Left4Dead 2. L'objectif était de créer une suite de niveau cohérent dans le jeu en groupe.\nNous avons décidé de faire un niveau dans des montagnes car c'est un cadre qui n'est pas utilisé dans le jeu de base et nous pensons que cela peut être un cadre interessant.\n\r\nJe me suis donc occupé de la 2ème partie du niveau. Cette partie correspond à la montée d'une montagne dans un cadre de tempête de neige.\nJ'ai réalisé un document détaillant tout le niveau disponible juste en dessous.",
        "images": [
            {
                "url": "assets/img/left4dead-plan-partie2-Robin_Lefebvre.png",
                "legende": "Le plan du niveau au complet"
            }
        ],
        "buttons": [
            {
                "name": "Voir le plan",
                "icon": "launch",
                "link": "assets/img/left4dead-plan-partie2-Robin_Lefebvre.png"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Première de magazine inspiré d'un jeu",
        "date": "Décembre 2022",
        "tags": [
            "2d"
        ],
        "img": "assets/img/Magazine-OuterWilds-Robin_Lefebvre.png",
        "description": "Ce travail est un montage fait sur Photoshop dans le cadre d'un cours d'infographie 2D.\nL'objectif était de réaliser la première de couverture d'un magazine dans l'univers d'un jeu.\n\r\nLe jeu que j'ai choisi est Outer Wilds. J'ai décidé de partir sur un magazine de science en m'inspirant d'une première de couverture de la revue scientifique \"nature\". \nJ'ai fait ce choix car Outer Wilds est un jeu qui se base grandement sur les sciences et imaginer un magazine créé dans ce monde parlant des dernières découvertes était amusant.",
        "images": [
            {
                "url": "assets/img/Magazine-OuterWilds-Robin_Lefebvre.png",
                "legende": "L'affiche dans son ensemble"
            }
        ],
        "buttons": [
            {
                "name": "Voir l'affiche",
                "icon": "launch",
                "link": "assets/img/Magazine-OuterWilds-Robin_Lefebvre.png"
            }
        ],
        "keep": false,
        "main": false
    },
    {
        "name": "Screen modifié venant d'un jeu",
        "date": "Décembre 2022",
        "tags": [
            "2d"
        ],
        "img": "assets/img/Screen-OuterWilds-Robin_Lefebvre.png",
        "description": "Ce travail est un montage fait sur Photoshop dans le cadre d'un cours d'infographie 2D.\n L'objectif était de modifier un screenshot d'un jeu afin de changer l'univers dans lequel il se déroule.\nLe jeu que j'ai choisi est Outer Wilds. A la place de faire dérouler le jeu dans un univers spatial, je me suis inspiré de \"Vingt Mille lieues sous les mers\", de l'imagerie Steampunk et de Bioshock pour modifier l'univers du jeu afin qu'il se déroule dans les fonds marin.",
        "images": [
            {
                "url": "assets/img/Screen-OuterWilds-Robin_Lefebvre.png",
                "legende": "Screen modifié"
            }
        ],
        "buttons": [
            {
                "name": "Voir le screen modifié",
                "icon": "launch",
                "link": "assets/img/Screen-OuterWilds-Robin_Lefebvre.png"
            }
        ],
        "keep": false,
        "main": false
    },
    {
        "name": "The Dark Labyrinth",
        "date": "Novembre 2022",
        "tags": [
            "gd"
        ],
        "img": "assets/img/THE-DARK-LABYRINTH.png",
        "description": "The Dark Labyrinth est un game concept que j'ai réalisé en binôme dans le cadre d'un cours sur le game design.\nL'objectif était de faire un jeu avec la contrainte d'un support, ici, le support était hybride.\n\r\nPitch : \"Enfuyez-vous d'un labyrinthe sur le point de s'effondrer. Déplacer votre pion pour découvrir le labyrinthe, remplir les objectifs et vous enfuir. Attention, le premier qui s'enfuit enferme les autres.\"",
        "images": [
            {
                "url": "assets/img/schema-gd-hybride.png",
                "legende": "Schéma du dispositif"
            },
            {
                "url": "assets/img/schema-gd-hybride2.png",
                "legende": "Schéma du plateau de jeu"
            }
        ],
        "buttons": [
            {
                "name": "Voir la fiche détaillée du game concept",
                "icon": "launch",
                "link": "data/THE-DARK-LABYRINTH.pdf"
            }
        ],
        "keep": false,
        "main": false
    },
    {
        "name": "Don't be Fired Simulator",
        "date": "Novembre 2022",
        "tags": [
            "gd"
        ],
        "img": "assets/img/wip-dontbefired.png",
        "description": "Don't be Fired Simulator est un game concept que j'ai réalisé dans le cadre d'un cours sur le game design. L'objectif était de faire un party games.\nPitch : \"Vous et 3 collègues avez un patron difficile à vivre. Au moindre malaise ou erreur, vous vous faites virer. Avant vous étiez 100 dans le bureau maintenant, vous n'êtes plus que 4. Il ne peut en rester qu'un. Lancez les objets sur votre bureau pour assommer vos collègues !\"",
        "images": [
            {
                "url": "assets/img/wip-dontbefired.png",
                "legende": "Schéma du jeu"
            },
            {
                "url": "assets/img/wip-dontbefired-rammaser.png",
                "legende": "Schéma d'un joueur qui va ramasser un objet au centre"
            },
            {
                "url": "assets/img/wip-dontbefired-reperer.png",
                "legende": "Schéma d'un joueur qui se fait repérer au centre par le patron"
            }
        ],
        "buttons": [
            {
                "name": "Voir la fiche détaillée du game concept",
                "icon": "launch",
                "link": "data/Exercice_Party_Games-Game_design.pdf"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Living Rock",
        "date": "Octobre 2022",
        "tags": [
            "ld",
            "gd"
        ],
        "img": "assets/img/LivingRock.png",
        "description": "Living Rock est un jeu que j'ai réalisé avec une équipe de 7 personnes en tant que Level Designer/Game Designer lors de l'UniJam 2022 en un weekend. Le thème de l'Unijam était \"La distance rend toute chose infiniment plus précieuse\". \n\r\n L'idée de base était de réaliser un jeu de combat qui utilise la distance avec un élément pour certaines mécaniques. Mais ayant peur que ça soit une charge de travail trop importante nous nous sommes dirigés vers un jeu à énigme.\n\r\n Nous incarnons donc un personnage qui se voit lié à un cristal, s'il s'éloigne de trop il meurt, il va donc devoir le prendre avec lui à tout moment. Il va pouvoir utiliser le cristal pour résoudre des énigmes.\n\r\n Nous avons donc commencé à travailler sur le Game Concept afin de trouver les mécaniques les plus interessantes à réaliser dans le jeu. Nous avons travaillé à deux sur cette partie-là, j'avais un rôle de support puisque ma fonction principale était le Level Design.\n Une fois les mécaniques et le game concept terminés le Game Designer de l'équipe a commencé à faire le Game Document allant plus précisément dans les détails et moi j'ai commencé à faire le Level Design.\n\r\n Le Level Design a été un vrai défi pour moi puisque je n'avais jamais fait de niveau à énigmes et cela a été une vraie gymnastique d'esprit de faire des niveaux cohérents, montant en difficulté sans que ça soit trop complexe. J'ai cherché à utiliser les mécaniques en lien avec le cristal au maximum afin de rendre ça le plus intéressant possible. On avait également pensé à des mécaniques jouant avec la visibilité ou encore un niveau consacré uniquement à une mécanique de téléportation influençant le cristal mais nous n'avons pas eu le temps d'intégrer ces niveaux. Cette Game Jam fut très intéressante car c'était la première fois que j'en faisais une en équipe et j'ai beaucoup appris en ce qui concerne le travail d'équipe mais également en Level Design.\n",
        "images": [
            {
                "url": "assets/img/LivingRock.png",
                "legende": "Illustration faite pour le jeu"
            },
            {
                "url": "assets/img/LivingRock-game.png",
                "legende": "Screen in-game"
            },
            {
                "url": "assets/img/Schema-livingrock.png",
                "legende": "Schéma du niveau que j'ai réalisé en tant que Level Designer"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://tiosstud.itch.io/living-rock"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Jeu de société MashUp",
        "date": "Octobre 2022",
        "tags": [
            "gd"
        ],
        "img": "assets/img/mashup1.jpg",
        "description": "MashUp est un jeu de société que nous avons prototypé en 1 semaine. En effet, dans le cadre de ma formation, une Game Jam de jeux de société était organisée. L'objectif était de réaliser un prototype de jeu de société en 1 semaine avec pour thème \"The more you have the worst it gets\". \n\n J'ai travaillé sur MashUp principalement en tant que Game Designer, nous avons réfléchi le jeu afin qu'il soit fun à jouer à l'apéro ou en soirée.\n Dans MashUp on doit associer plusieurs cartes représentant quelques choses (par exemple : un personnage ou un objet) afin de répondre à une contrainte. \n\n Exemple : Créer  la combinaison la plus mignonne : un chat en robe de princesse en utilisant la carte \"chat\" et la carte \"robe de princesse\". Une fois que tous les joueurs ont proposé leur combinaison, chacun vote, la personne la plus votée remporte la partie.",
        "images": [
            {
                "url": "assets/img/mashup1.jpg",
                "legende": "Le dessus de la boîte."
            },
            {
                "url": "assets/img/mashup3.jpg",
                "legende": "L'arrière de la boîte."
            },
            {
                "url": "assets/img/mashup4.jpg",
                "legende": "L'intérieur de la boîte."
            },
            {
                "url": "assets/img/mashup2.png",
                "legende": "Exemple de cartes"
            }
        ],
        "buttons": [],
        "keep": true,
        "main": false
    },
    {
        "name": "Niveau d'infiltration GTA",
        "date": "Octobre 2022",
        "tags": [
            "ld"
        ],
        "img": "assets/img/Niveau_Discretion-Gta.png",
        "description": "Ce travail est un plan de level design pour le jeu GTA réalisé dans le cadre d'un cours de Level Design. L'objectif était de faire un niveau d'infiltration pour un jeu d'action aventure, ici, GTA.\n\r\nLe héros se réveille dans une cave. En sortant de cette cave, il arrive dans une maison traditionnelle japonaise controler par des yakuzas. Il va donc devoir s'infiltrer dans cette maison pour trouver un moyen de sortir.\n Deux moyens s'offrent à lui, soit trouver de l'essence et faire brûler un tas de bois inflamable dans le fond du jardin de la résidence afin de s'extirper discrétement une fois toute l'attention sur le tas de bois. Soit il trouve des explosifs pour faire exploser le mur près de la porte afin de s'enfuir. \nAu cours de son parcours, il peut chercher des trésors présents un peu partout dans la maison.",
        "images": [
            {
                "url": "assets/img/Niveau_Discretion-Gta.png",
                "legende": "La plan du niveau"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "assets/img/Niveau_Discretion-Gta.png"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Niveau de Mario World",
        "date": "Octobre 2022",
        "tags": [
            "ld"
        ],
        "img": "assets/img/LD-Mario.png",
        "description": "Ce travail est un plan de level design pour le jeu Mario World.\nL'objectif était de prendre une mécanique du jeu et de faire un niveau en l'exploitant.\nLa mécanique que j'ai décidé d'exploiter est le saut sur les ennemis afin de faire des sauts plus hauts.\n\r\nJ'ai donc divisé le niveau en 4 parties. \nTout d'abord la partie apprentissage qui met le joueur dans un cadre où il peut difficilement mourir afin qu'il apprenne la mécanique. \nEnsuite la partie application dans laquelle j'ai essayé d'appliquer la mécanique à plusieurs cas différents. \nPuis la partie twist dans laquelle j'ai essayé de prendre la mécanique à revers, à la place de sauter il faut gérer son saut pour éviter d'aller trop haut sous peine de se faire toucher par des piques. \nPour finir, la partie maîtrise plus complexe qui demande vitesse et adresse au joueur.",
        "images": [
            {
                "url": "assets/img/LD-Mario.png",
                "legende": "Plan du niveau"
            }
        ],
        "buttons": [
            {
                "name": "Voir le plan",
                "icon": "launch",
                "link": "assets/img/LD-Mario.png"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Chrono Bullet Hell Prototype",
        "date": "Août 2022",
        "tags": [
            "gj",
            "gd",
            "dev"
        ],
        "img": "assets/img/chronobullethell-2.png",
        "description": "Chrono Bullet Hell Prototype est un prototype de jeu Bullet Hell que j'ai créé lors de la Mini Jam 112 : Chrono. Cette Game Jam avait pour thème \"Chrono\" et pour contrainte \"Only 3 buttons\". \n\r\nLe jeu se situe donc sur un cadran d'horloge. Le personnage qu'on joue peut avancer ou reculer d'heure en heure afin d'éviter les tirs arrivants vers lui. Pour ce faire il peut également utiliser un multiplicateur qui lui permet d'avancer ou de reculer un plus grand nombre d'heures en une fois. \n\r\nLors de cette Game Jam, j'ai commencé en posant mes idées sur papier en imaginant autour du thème. Grâce à ce processus j'ai pu cette fois-ci définir un scope plus petit et plus réaliste. Malgré tout il est important de préciser que là où l'idée était plus claire, le projet lui manquait de structure ce qui m'a beaucoup freiné. \n\r\nJe voulais au début ajouter une mécanique de temps qui permettait d'avancer plus loin ou moins loin en fonction du temps qu'une des touches était retenue. Au final, j'ai rejeté cette idée car rendait trop injuste le jeu car tout n'était qu'histoire de timing. \n\r\nPour le moment le jeu n'est que de la survie mais par la suite on peut imaginer des niveaux utilisant des mécaniques différentes.\n\r\nPar exemple : \nUn niveau jouant avec la lumière.\nUn niveau avec des éléments à récupérer sur le cadran afin de vaincre un boss.\n\r\nPlus simplement, des patterns plus complexes demandant de la précisison.",
        "images": [
            {
                "url": "assets/img/chronobullethell-1.png",
                "legende": "Screen du jeu"
            },
            {
                "url": "assets/img/chronobullethell-2.png",
                "legende": "Screen du jeu"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://purpleluma.itch.io/chrono-bullet-hell"
            }
        ],
        "keep": false,
        "main": false
    },
    {
        "name": "Black & White Prototype",
        "date": "Juillet 2022",
        "tags": [
            "gj",
            "gd",
            "ld",
            "dev"
        ],
        "img": "assets/img/BlackAndWhiteColorJam.png",
        "description": "Black & White Prototype est un prototype de jeu d'énigme que j'ai commencé lors de la Mini Jam 111 : Colors². Cette Game Jam avait pour thème \"Colors\" et pour contrainte \"You are your own ennemy\".\n\r\nC'est une Game Jam assez courte et ma première erreur lors de cette dernière a été de me lancer sans poser de manière précise ce que je voulais réaliser. Le résultat a été que je n'ai pas réussi à finir le jeu à temps pour la fin de la Jam.\n Mon idée principale était de réaliser un jeu d'énigme dans lequel, il fallait réaliser un parcours sans mourir sous peine de devoir le recommencer. Une fois le niveau terminé, notre double sur la partie droite de l'écran reproduit les déplacements réalisés. S'il finit le niveau, on perd, s'il perd on gagne. Le problème principal dans le prototype que j'ai réalisé en Juillet 2022 est que la mort de notre double dépend de timing et non pas de réflexion. En repensant le jeu, quelques éléments de gameplay interessants pourrait être ajouter afin que cela soit de la reflexion et non pas du timing. Par exemple :\nUn piège qui s'active après un certain nombre d'actions, les siennes et celles du double. L'objectif serait que le joueur doit calculer son nombre d'actions pour piéger son double.\nAu lieu de faire une division entre la partie du joueur et du double, il faudrait permettre aux joueurs d'intéragir avec des éléments du côté du double.",
        "images": [
            {
                "url": "assets/img/BlackAndWhiteColorJam.png",
                "legende": "Screen du jeu"
            }
        ],
        "buttons": [],
        "keep": false,
        "main": false
    },
    {
        "name": "Cosmic Jack",
        "date": "Novembre 2021 et Mai 2022",
        "tags": [
            "gj",
            "gd",
            "dev"
        ],
        "img": "assets/img/CosmicJackWeb.png",
        "description": "Jeu que j'ai réalisé une première fois en JavaScript en Novembre 2021 pour l'entrepise dans laquelle travaillait mon frère. J'ai donc réalisé la partie développement et mon frère la partie graphique. \nOn a fait un jeu inspiré du jeu du T-Rex car on voulait qu'il soit facilement jouable par tous et que ça soit un jeu à score. J'ai par la suite refait le jeu en Mai 2022 sur Unity afin de prendre en main le logiciel mais également afin d'avoir un jeu plus proche de ce que j'attendais.",
        "images": [
            {
                "url": "assets/img/CosmicJackWeb.png",
                "legende": "Screen de Cosmic Jack Web"
            },
            {
                "url": "assets/img/CosmicUnity.png",
                "legende": "Screen de Cosmic Unity"
            }
        ],
        "buttons": [
            {
                "name": "Voir Cosmic Jack version Web",
                "icon": "launch",
                "link": "https://ginko-conseil.com/cosmic-jack/"
            },
            {
                "name": "Voir Cosmic Unity",
                "icon": "launch",
                "link": "https://purpleluma.itch.io/cosmic-jack"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Analyseur de croquettes NicePet",
        "date": "Avril 2022",
        "tags": [
            "dev",
            "web"
        ],
        "img": "assets/img/NicePet.png",
        "description": "L'analyseur de croquettes est un site web et une application que j'ai réalisée en équipe lors d'un évenement organisé par mon DUT Informatique nommé la Startup Week. \nL'objectif était de répondre à une demande d'une startup en une semaine.\nNous avons donc réalisé un analyseur de croquettes pour la startup NicePet. Je me suis occupé de toute la partie API.",
        "images": [
            {
                "url": "assets/img/NicePet.png",
                "legende": "Screen de l'interface web"
            }
        ],
        "buttons": [],
        "keep": false,
        "main": false
    },
    {
        "name": "Lecteur de fichier PLY",
        "date": "Mars 2022",
        "tags": [
            "dev"
        ],
        "img": "assets/img/CaptureProjet4.png",
        "description": "Le Lecteur de fichier PLY (fichier 3D) est un projet que j'ai réalisé en colaboration avec des camarades de classes lors de mon DUT Informatique. C'est un projet qui nous a demandé de travailler fortement en équipe puisque la charge de travail était assez importante, une répartition des tâches de manière précise était indispensable.\n\r\nJe me suis personnellement occupé tout d'abord du triage des points dans le fichier PLY afin de pouvoir afficher dans le bon ordre les faces des objets 3D.\nJ'ai ensuite développé avec une autre personne du groupe toute la partie mathématiques qui demandait des calculs de vecteur dans un espace en 3 dimensions.\nPour finir j'ai également développé la lumière qui se projetait sur les objets en 3D.",
        "images": [
            {
                "url": "assets/img/CaptureProjet4.png",
                "legende": "Screen du logiciel"
            },
            {
                "url": "assets/img/ScreenProjet3.png",
                "legende": "Screen du logiciel"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://github.com/RobLfbv/PLYReader"
            }
        ],
        "keep": true,
        "main": false
    },
    {
        "name": "Rope Game Prototype",
        "date": "Janvier 2022",
        "tags": [
            "gj",
            "gd",
            "ld",
            "dev"
        ],
        "img": "assets/img/ropeproto.png",
        "description": "Rope Game Prototype est un prototype de jeu de plateforme se jouant avec des cordes. J'ai réalisé ce jeu lors de la Game Jam My First Game Jam: Winter 2022 qui avait pour thème \"Nature\".\nCe jeu a été une sorte de défi technique pour moi car cela m'a demandé de comprendre en détail comment fonctionnait Unity. C'était également ma première Game Jam j'ai donc fait beaucoup d'erreurs : je me suis mal organisé et je n'ai pas assez posé mes idées. Mais pour une première Game Jam, j'étais assez fier du résultat malgré tout.",
        "images": [
            {
                "url": "assets/img/ropeproto.png",
                "legende": "Screen du jeu"
            }
        ],
        "buttons": [
            {
                "name": "Voir le projet",
                "icon": "launch",
                "link": "https://purpleluma.itch.io/rope-game-prototype"
            }
        ],
        "keep": false,
        "main": false
    }
]